GopalSaraf/Practicals/PSDL/include/proc/pic18f8585.inc
// Register: TXB2SIDL
#define TXB2SIDL TXB2SIDL
TXB2SIDL                                 equ 0F22h
// bitfield definitions
TXB2SIDL_EID16_POSN                      equ 0000h
TXB2SIDL_EID16_POSITION                  equ 0000h
TXB2SIDL_EID16_SIZE                      equ 0001h
TXB2SIDL_EID16_LENGTH                    equ 0001h
TXB2SIDL_EID16_MASK                      equ 0001h
TXB2SIDL_EID17_POSN                      equ 0001h
TXB2SIDL_EID17_POSITION                  equ 0001h
TXB2SIDL_EID17_SIZE                      equ 0001h
TXB2SIDL_EID17_LENGTH                    equ 0001h
TXB2SIDL_EID17_MASK                      equ 0002h
TXB2SIDL_EXIDE_POSN                      equ 0003h
TXB2SIDL_EXIDE_POSITION                  equ 0003h
TXB2SIDL_EXIDE_SIZE                      equ 0001h
TXB2SIDL_EXIDE_LENGTH                    equ 0001h
TXB2SIDL_EXIDE_MASK                      equ 0008h
TXB2SIDL_SID0_POSN                       equ 0005h
TXB2SIDL_SID0_POSITION                   equ 0005h
TXB2SIDL_SID0_SIZE                       equ 0001h
TXB2SIDL_SID0_LENGTH                     equ 0001h
TXB2SIDL_SID0_MASK                       equ 0020h
TXB2SIDL_SID1_POSN                       equ 0006h
TXB2SIDL_SID1_POSITION                   equ 0006h
TXB2SIDL_SID1_SIZE                       equ 0001h
TXB2SIDL_SID1_LENGTH                     equ 0001h
TXB2SIDL_SID1_MASK                       equ 0040h
TXB2SIDL_SID2_POSN                       equ 0007h
TXB2SIDL_SID2_POSITION                   equ 0007h
TXB2SIDL_SID2_SIZE                       equ 0001h
TXB2SIDL_SID2_LENGTH                     equ 0001h
TXB2SIDL_SID2_MASK                       equ 0080h
TXB2SIDL_TXB2EID16_POSN                  equ 0000h
TXB2SIDL_TXB2EID16_POSITION              equ 0000h
TXB2SIDL_TXB2EID16_SIZE                  equ 0001h
TXB2SIDL_TXB2EID16_LENGTH                equ 0001h
TXB2SIDL_TXB2EID16_MASK                  equ 0001h
TXB2SIDL_TXB2EID17_POSN                  equ 0001h
TXB2SIDL_TXB2EID17_POSITION              equ 0001h
TXB2SIDL_TXB2EID17_SIZE                  equ 0001h
TXB2SIDL_TXB2EID17_LENGTH                equ 0001h
TXB2SIDL_TXB2EID17_MASK                  equ 0002h
TXB2SIDL_TXB2EXIDE_POSN                  equ 0003h
TXB2SIDL_TXB2EXIDE_POSITION              equ 0003h
TXB2SIDL_TXB2EXIDE_SIZE                  equ 0001h
TXB2SIDL_TXB2EXIDE_LENGTH                equ 0001h
TXB2SIDL_TXB2EXIDE_MASK                  equ 0008h
TXB2SIDL_TXB2SID0_POSN                   equ 0005h
TXB2SIDL_TXB2SID0_POSITION               equ 0005h
TXB2SIDL_TXB2SID0_SIZE                   equ 0001h
TXB2SIDL_TXB2SID0_LENGTH                 equ 0001h
TXB2SIDL_TXB2SID0_MASK                   equ 0020h
TXB2SIDL_TXB2SID1_POSN                   equ 0006h
TXB2SIDL_TXB2SID1_POSITION               equ 0006h
TXB2SIDL_TXB2SID1_SIZE                   equ 0001h
TXB2SIDL_TXB2SID1_LENGTH                 equ 0001h
TXB2SIDL_TXB2SID1_MASK                   equ 0040h
TXB2SIDL_TXB2SID2_POSN                   equ 0007h
TXB2SIDL_TXB2SID2_POSITION               equ 0007h
TXB2SIDL_TXB2SID2_SIZE                   equ 0001h
TXB2SIDL_TXB2SID2_LENGTH                 equ 0001h
TXB2SIDL_TXB2SID2_MASK                   equ 0080h

// Register: TXB2EIDH
#define TXB2EIDH TXB2EIDH
TXB2EIDH                                 equ 0F23h
// bitfield definitions
TXB2EIDH_EID8_POSN                       equ 0000h
TXB2EIDH_EID8_POSITION                   equ 0000h
TXB2EIDH_EID8_SIZE                       equ 0001h
TXB2EIDH_EID8_LENGTH                     equ 0001h
TXB2EIDH_EID8_MASK                       equ 0001h
TXB2EIDH_EID9_POSN                       equ 0001h
TXB2EIDH_EID9_POSITION                   equ 0001h
TXB2EIDH_EID9_SIZE                       equ 0001h
TXB2EIDH_EID9_LENGTH                     equ 0001h
TXB2EIDH_EID9_MASK                       equ 0002h
TXB2EIDH_EID10_POSN                      equ 0002h
TXB2EIDH_EID10_POSITION                  equ 0002h
TXB2EIDH_EID10_SIZE                      equ 0001h
TXB2EIDH_EID10_LENGTH                    equ 0001h
TXB2EIDH_EID10_MASK                      equ 0004h
TXB2EIDH_EID11_POSN                      equ 0003h
TXB2EIDH_EID11_POSITION                  equ 0003h
TXB2EIDH_EID11_SIZE                      equ 0001h
TXB2EIDH_EID11_LENGTH                    equ 0001h
TXB2EIDH_EID11_MASK                      equ 0008h
TXB2EIDH_EID12_POSN                      equ 0004h
TXB2EIDH_EID12_POSITION                  equ 0004h
TXB2EIDH_EID12_SIZE                      equ 0001h
TXB2EIDH_EID12_LENGTH                    equ 0001h
TXB2EIDH_EID12_MASK                      equ 0010h
TXB2EIDH_EID13_POSN                      equ 0005h
TXB2EIDH_EID13_POSITION                  equ 0005h
TXB2EIDH_EID13_SIZE                      equ 0001h
TXB2EIDH_EID13_LENGTH                    equ 0001h
TXB2EIDH_EID13_MASK                      equ 0020h
TXB2EIDH_EID14_POSN                      equ 0006h
TXB2EIDH_EID14_POSITION                  equ 0006h
TXB2EIDH_EID14_SIZE                      equ 0001h
TXB2EIDH_EID14_LENGTH                    equ 0001h
TXB2EIDH_EID14_MASK                      equ 0040h
TXB2EIDH_EID15_POSN                      equ 0007h
TXB2EIDH_EID15_POSITION                  equ 0007h
TXB2EIDH_EID15_SIZE                      equ 0001h
TXB2EIDH_EID15_LENGTH                    equ 0001h
TXB2EIDH_EID15_MASK                      equ 0080h
TXB2EIDH_TXB2EID8_POSN                   equ 0000h
TXB2EIDH_TXB2EID8_POSITION               equ 0000h
TXB2EIDH_TXB2EID8_SIZE                   equ 0001h
TXB2EIDH_TXB2EID8_LENGTH                 equ 0001h
TXB2EIDH_TXB2EID8_MASK                   equ 0001h
TXB2EIDH_TXB2EID9_POSN                   equ 0001h
TXB2EIDH_TXB2EID9_POSITION               equ 0001h
TXB2EIDH_TXB2EID9_SIZE                   equ 0001h
TXB2EIDH_TXB2EID9_LENGTH                 equ 0001h
TXB2EIDH_TXB2EID9_MASK                   equ 0002h
TXB2EIDH_TXB2EID10_POSN                  equ 0002h
TXB2EIDH_TXB2EID10_POSITION              equ 0002h
TXB2EIDH_TXB2EID10_SIZE                  equ 0001h
TXB2EIDH_TXB2EID10_LENGTH                equ 0001h
TXB2EIDH_TXB2EID10_MASK                  equ 0004h
TXB2EIDH_TXB2EID11_POSN                  equ 0003h
TXB2EIDH_TXB2EID11_POSITION              equ 0003h
TXB2EIDH_TXB2EID11_SIZE                  equ 0001h
TXB2EIDH_TXB2EID11_LENGTH                equ 0001h
TXB2EIDH_TXB2EID11_MASK                  equ 0008h
TXB2EIDH_TXB2EID12_POSN                  equ 0004h
TXB2EIDH_TXB2EID12_POSITION              equ 0004h
TXB2EIDH_TXB2EID12_SIZE                  equ 0001h
TXB2EIDH_TXB2EID12_LENGTH                equ 0001h
TXB2EIDH_TXB2EID12_MASK                  equ 0010h
TXB2EIDH_TXB2EID13_POSN                  equ 0005h
TXB2EIDH_TXB2EID13_POSITION              equ 0005h
TXB2EIDH_TXB2EID13_SIZE                  equ 0001h
TXB2EIDH_TXB2EID13_LENGTH                equ 0001h
TXB2EIDH_TXB2EID13_MASK                  equ 0020h
TXB2EIDH_TXB2EID14_POSN                  equ 0006h
TXB2EIDH_TXB2EID14_POSITION              equ 0006h
TXB2EIDH_TXB2EID14_SIZE                  equ 0001h
TXB2EIDH_TXB2EID14_LENGTH                equ 0001h
TXB2EIDH_TXB2EID14_MASK                  equ 0040h
TXB2EIDH_TXB2EID15_POSN                  equ 0007h
TXB2EIDH_TXB2EID15_POSITION              equ 0007h
TXB2EIDH_TXB2EID15_SIZE                  equ 0001h
TXB2EIDH_TXB2EID15_LENGTH                equ 0001h
TXB2EIDH_TXB2EID15_MASK                  equ 0080h

// Register: TXB2EIDL
#define TXB2EIDL TXB2EIDL
TXB2EIDL                                 equ 0F24h
// bitfield definitions
TXB2EIDL_EID0_POSN                       equ 0000h
TXB2EIDL_EID0_POSITION                   equ 0000h
TXB2EIDL_EID0_SIZE                       equ 0001h
TXB2EIDL_EID0_LENGTH                     equ 0001h
TXB2EIDL_EID0_MASK                       equ 0001h
TXB2EIDL_EID1_POSN                       equ 0001h
TXB2EIDL_EID1_POSITION                   equ 0001h
TXB2EIDL_EID1_SIZE                       equ 0001h
TXB2EIDL_EID1_LENGTH                     equ 0001h
TXB2EIDL_EID1_MASK                       equ 0002h
TXB2EIDL_EID2_POSN                       equ 0002h
TXB2EIDL_EID2_POSITION                   equ 0002h
TXB2EIDL_EID2_SIZE                       equ 0001h
TXB2EIDL_EID2_LENGTH                     equ 0001h
TXB2EIDL_EID2_MASK                       equ 0004h
TXB2EIDL_EID3_POSN                       equ 0003h
TXB2EIDL_EID3_POSITION                   equ 0003h
TXB2EIDL_EID3_SIZE                       equ 0001h
TXB2EIDL_EID3_LENGTH                     equ 0001h
TXB2EIDL_EID3_MASK                       equ 0008h
TXB2EIDL_EID4_POSN                       equ 0004h
TXB2EIDL_EID4_POSITION                   equ 0004h
TXB2EIDL_EID4_SIZE                       equ 0001h
TXB2EIDL_EID4_LENGTH                     equ 0001h
TXB2EIDL_EID4_MASK                       equ 0010h
TXB2EIDL_EID5_POSN                       equ 0005h
TXB2EIDL_EID5_POSITION                   equ 0005h
TXB2EIDL_EID5_SIZE                       equ 0001h
TXB2EIDL_EID5_LENGTH                     equ 0001h
TXB2EIDL_EID5_MASK                       equ 0020h
TXB2EIDL_EID6_POSN                       equ 0006h
TXB2EIDL_EID6_POSITION                   equ 0006h
TXB2EIDL_EID6_SIZE                       equ 0001h
TXB2EIDL_EID6_LENGTH                     equ 0001h
TXB2EIDL_EID6_MASK                       equ 0040h
TXB2EIDL_EID7_POSN                       equ 0007h
TXB2EIDL_EID7_POSITION                   equ 0007h
TXB2EIDL_EID7_SIZE                       equ 0001h
TXB2EIDL_EID7_LENGTH                     equ 0001h
TXB2EIDL_EID7_MASK                       equ 0080h
TXB2EIDL_TXB2EID0_POSN                   equ 0000h
TXB2EIDL_TXB2EID0_POSITION               equ 0000h
TXB2EIDL_TXB2EID0_SIZE                   equ 0001h
TXB2EIDL_TXB2EID0_LENGTH                 equ 0001h
TXB2EIDL_TXB2EID0_MASK                   equ 0001h
TXB2EIDL_TXB2EID1_POSN                   equ 0001h
TXB2EIDL_TXB2EID1_POSITION               equ 0001h
TXB2EIDL_TXB2EID1_SIZE                   equ 0001h
TXB2EIDL_TXB2EID1_LENGTH                 equ 0001h
TXB2EIDL_TXB2EID1_MASK                   equ 0002h
TXB2EIDL_TXB2EID2_POSN                   equ 0002h
TXB2EIDL_TXB2EID2_POSITION               equ 0002h
TXB2EIDL_TXB2EID2_SIZE                   equ 0001h
TXB2EIDL_TXB2EID2_LENGTH                 equ 0001h
TXB2EIDL_TXB2EID2_MASK                   equ 0004h
TXB2EIDL_TXB2EID3_POSN                   equ 0003h
TXB2EIDL_TXB2EID3_POSITION               equ 0003h
TXB2EIDL_TXB2EID3_SIZE                   equ 0001h
TXB2EIDL_TXB2EID3_LENGTH                 equ 0001h
TXB2EIDL_TXB2EID3_MASK                   equ 0008h
TXB2EIDL_TXB2EID4_POSN                   equ 0004h
TXB2EIDL_TXB2EID4_POSITION               equ 0004h
TXB2EIDL_TXB2EID4_SIZE                   equ 0001h
TXB2EIDL_TXB2EID4_LENGTH                 equ 0001h
TXB2EIDL_TXB2EID4_MASK                   equ 0010h
TXB2EIDL_TXB2EID5_POSN                   equ 0005h
TXB2EIDL_TXB2EID5_POSITION               equ 0005h
TXB2EIDL_TXB2EID5_SIZE                   equ 0001h
TXB2EIDL_TXB2EID5_LENGTH                 equ 0001h
TXB2EIDL_TXB2EID5_MASK                   equ 0020h
TXB2EIDL_TXB2EID6_POSN                   equ 0006h
TXB2EIDL_TXB2EID6_POSITION               equ 0006h
TXB2EIDL_TXB2EID6_SIZE                   equ 0001h
TXB2EIDL_TXB2EID6_LENGTH                 equ 0001h
TXB2EIDL_TXB2EID6_MASK                   equ 0040h
TXB2EIDL_TXB2EID7_POSN                   equ 0007h
TXB2EIDL_TXB2EID7_POSITION               equ 0007h
TXB2EIDL_TXB2EID7_SIZE                   equ 0001h
TXB2EIDL_TXB2EID7_LENGTH                 equ 0001h
TXB2EIDL_TXB2EID7_MASK                   equ 0080h

